assignments/lab-02-averages.tex
% Created 2015-01-23 Fri 13:44
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{minted}
\usepackage{minted}
\usemintedstyle{default}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Lab 02: Find Average of a Group of Numbers}
\author{CSci 515 Spring 2015}
\date{2015-01-23}
\hypersetup{
  pdfkeywords={},
  pdfsubject={Lab 02},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle


\section*{Dates:}
\label{sec-1}


\begin{center}
\begin{tabular}{ll}
 Due:  &  In Lab, Wednesday January 28, by 4 pm (lab end time)  \\
\end{tabular}
\end{center}
\section*{Objectives}
\label{sec-2}

\begin{itemize}
\item Practice writing sentinel-controlled loops.
\item Become familiar with basic if..else decisions, and simple boolean logic.
\item Practice with arithmetic and type conversion in C.
\end{itemize}
\section*{Description}
\label{sec-3}

Determine the average, and some other properties for an arbitrary
number of integer values.  The user should be prompted to enter
numbers and to indicate when they are done entering numbers by using a
sentinel (use -9999 as your sentinel value).

Your program should report the following values after the user has
indicated they are finished entering numbers.  The average of the
values, the minimum value entered, the maximum value entered, and the
total number of values the user entered.  The output of your results
should be formatted to the terminal to look exactly like this:


\begin{verbatim}
Number of Values Entered: 5
Maximum Value: 28
Minimum Value: -32
Average Value: 18.5236
\end{verbatim}
\section*{Lab Submission}
\label{sec-4}


An eCollege dropbox has been created for this assignment.  You should upload your version of the lab by the
end of lab time to the eCollege dropbox named \verb~Lab 02 Average of Values~.
\section*{Requirements}
\label{sec-5}

Your programs must conform to the style and formatting guidelines given for this course.
The following is a list of the guidelines that are required for this lab:

\begin{itemize}
\item The file header and function header for your main function must be present, and filled out correctly.
\item You must indent your code correctly and have no embedded tabs in your source code.
\item You must not have any statements that are hacks in order to keep your terminal from closing when your program exits.
\item You must have a single space before and after each binary operator.
\item You must have a single blank line after the end of your declaration of variables at the top of a function, before the first code statement.
\end{itemize}

Failure to conform to these particular guidelines for this lab will
result in a grade of 0 for the lab, and it being returned with an
indication of which of these items your program violates.  Failure to
follow other class/textbook programming guidelines may result in a
loss of points, especially for those good programming practices given
in chapters 1-5 of our textbook which you are to have read by now.

\end{document}
